{"PartitionKey":"CATemplate","RowKey":"15aa5c1f-9cad-4855-8d32-80c6813a7b1a","GUID":"15aa5c1f-9cad-4855-8d32-80c6813a7b1a","JSON":"{\"tenantFilter\":[{\"value\":\"Template Tenant\",\"label\":\"Template Tenant\"}],\"id\":\"c8b8cfec-41d8-431e-9649-3c19c33084dd\",\"displayName\":\"MFA Setup Only From HQ\",\"createdDateTime\":\"2025-06-09T11:12:57.32766Z\",\"modifiedDateTime\":\"2025-06-09T11:44:00.3942415Z\",\"state\":\"enabledForReportingButNotEnforced\",\"conditions\":{\"userRiskLevels\":[],\"signInRiskLevels\":[],\"clientAppTypes\":[\"all\"],\"platforms\":null,\"times\":null,\"deviceStates\":null,\"devices\":null,\"clientApplications\":null,\"applications\":{\"includeApplications\":[],\"excludeApplications\":[],\"includeUserActions\":[\"urn:user:registersecurityinfo\"],\"includeAuthenticationContextClassReferences\":[],\"applicationFilter\":null},\"users\":{\"includeUsers\":[\"All\"],\"excludeUsers\":[],\"includeGroups\":[],\"excludeGroups\":[],\"includeRoles\":[],\"excludeRoles\":[\"62e90394-69f5-4237-9190-012177145e10\"],\"includeGuestsOrExternalUsers\":null,\"excludeGuestsOrExternalUsers\":{\"guestOrExternalUserTypes\":\"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider\",\"externalTenants\":{\"@odata.type\":\"#microsoft.graph.conditionalAccessAllExternalTenants\",\"membershipKind\":\"all\"}}},\"locations\":{\"includeLocations\":[\"All\"],\"excludeLocations\":[\"PIT_HQ\"]}},\"grantControls\":{\"operator\":\"OR\",\"builtInControls\":[\"block\"],\"customAuthenticationFactors\":[],\"termsOfUse\":[],\"authenticationStrength@odata.context\":\"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('c8b8cfec-41d8-431e-9649-3c19c33084dd')/grantControls/authenticationStrength/$entity\",\"authenticationStrength\":null},\"LocationInfo\":[null,{\"@odata.type\":\"#microsoft.graph.ipNamedLocation\",\"displayName\":\"PIT_HQ\",\"isTrusted\":true,\"ipRanges\":[{\"@odata.type\":\"#microsoft.graph.iPv4CidrRange\",\"cidrAddress\":\"188.39.124.218/32\"}]}]}"}