{"PartitionKey":"CATemplate","RowKey":"d8a8fecc-ff56-4f42-a616-49298a1b3dd7","GUID":"d8a8fecc-ff56-4f42-a616-49298a1b3dd7","JSON":"{\"tenantFilter\":[{\"label\":\"Template Tenant\",\"value\":\"Template Tenant\"}],\"id\":\"6422c7a6-faf3-4a71-a0cb-19926628fce6\",\"templateId\":\"b8bda7f8-6584-4446-bce9-d871480e53fa\",\"displayName\":\"MFA Setup Only From HQ\",\"createdDateTime\":\"2025-04-29T13:32:36.9969976Z\",\"modifiedDateTime\":\"2025-04-30T11:37:55.6329826Z\",\"state\":\"enabled\",\"conditions\":{\"userRiskLevels\":[],\"signInRiskLevels\":[],\"clientAppTypes\":[\"all\"],\"platforms\":null,\"times\":null,\"deviceStates\":null,\"devices\":null,\"clientApplications\":null,\"applications\":{\"includeApplications\":[],\"excludeApplications\":[],\"includeUserActions\":[\"urn:user:registersecurityinfo\"],\"includeAuthenticationContextClassReferences\":[],\"applicationFilter\":null},\"users\":{\"includeUsers\":[\"All\"],\"excludeUsers\":[\"PIT Admin\"],\"includeGroups\":[],\"excludeGroups\":[],\"includeRoles\":[],\"excludeRoles\":[\"62e90394-69f5-4237-9190-012177145e10\"],\"includeGuestsOrExternalUsers\":null,\"excludeGuestsOrExternalUsers\":{\"guestOrExternalUserTypes\":\"internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider\",\"externalTenants\":{\"@odata.type\":\"#microsoft.graph.conditionalAccessAllExternalTenants\",\"membershipKind\":\"all\"}}},\"locations\":{\"includeLocations\":[\"All\"],\"excludeLocations\":[\"00000000-0000-0000-0000-000000000000\",\"Bowood Leased Line WAN - Hotel\",\"PIT Office\"]}},\"grantControls\":{\"operator\":\"OR\",\"builtInControls\":[\"block\"],\"customAuthenticationFactors\":[],\"termsOfUse\":[],\"authenticationStrength@odata.context\":\"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('6422c7a6-faf3-4a71-a0cb-19926628fce6')/grantControls/authenticationStrength/$entity\",\"authenticationStrength\":null},\"LocationInfo\":[null,[{\"@odata.type\":\"#microsoft.graph.ipNamedLocation\",\"displayName\":\"Bowood Leased Line WAN - Hotel\",\"isTrusted\":true,\"ipRanges\":[{\"@odata.type\":\"#microsoft.graph.iPv4CidrRange\",\"cidrAddress\":\"62.232.167.101/29\"},{\"@odata.type\":\"#microsoft.graph.iPv4CidrRange\",\"cidrAddress\":\"62.232.167.101/32\"}]},{\"@odata.type\":\"#microsoft.graph.ipNamedLocation\",\"displayName\":\"PIT Office\",\"isTrusted\":false,\"ipRanges\":[{\"@odata.type\":\"#microsoft.graph.iPv4CidrRange\",\"cidrAddress\":\"188.39.124.218/32\"}]}]]}"}