{"PartitionKey":"CATemplate","RowKey":"b1cdb458-b036-44c1-b748-09e687607938","GUID":"b1cdb458-b036-44c1-b748-09e687607938","JSON":"{\"tenantFilter\":[{\"label\":\"Template Tenant\",\"value\":\"Template Tenant\"}],\"id\":\"80b504d3-c26d-448a-a418-3c021091c5fd\",\"displayName\":\"Zero Trust - Registered Devices Only\",\"createdDateTime\":\"2025-06-06T09:43:43.0010965Z\",\"modifiedDateTime\":\"2025-06-06T09:49:49.6711333Z\",\"state\":\"enabled\",\"conditions\":{\"userRiskLevels\":[],\"signInRiskLevels\":[],\"clientAppTypes\":[\"all\"],\"times\":null,\"deviceStates\":null,\"clientApplications\":null,\"applications\":{\"includeApplications\":[\"All\"],\"excludeApplications\":[],\"includeUserActions\":[],\"includeAuthenticationContextClassReferences\":[],\"applicationFilter\":null},\"users\":{\"includeUsers\":[\"All\"],\"excludeUsers\":[],\"includeGroups\":[],\"excludeGroups\":[],\"includeRoles\":[],\"excludeRoles\":[],\"includeGuestsOrExternalUsers\":null,\"excludeGuestsOrExternalUsers\":null},\"platforms\":{\"includePlatforms\":[\"all\"],\"excludePlatforms\":[]},\"locations\":{\"includeLocations\":[\"All\"],\"excludeLocations\":[\"PIT\"]},\"devices\":{\"includeDeviceStates\":[],\"excludeDeviceStates\":[],\"includeDevices\":[],\"excludeDevices\":[],\"deviceFilter\":{\"mode\":\"exclude\",\"rule\":\"device.trustType -eq \\\"AzureAD\\\" -or device.trustType -eq \\\"ServerAD\\\" -or device.trustType -eq \\\"Workplace\\\"\"}}},\"grantControls\":{\"operator\":\"OR\",\"builtInControls\":[\"block\"],\"customAuthenticationFactors\":[],\"termsOfUse\":[],\"authenticationStrength@odata.context\":\"https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('80b504d3-c26d-448a-a418-3c021091c5fd')/grantControls/authenticationStrength/$entity\",\"authenticationStrength\":null},\"LocationInfo\":[null,{\"@odata.type\":\"#microsoft.graph.ipNamedLocation\",\"displayName\":\"PIT\",\"isTrusted\":true,\"ipRanges\":[{\"@odata.type\":\"#microsoft.graph.iPv4CidrRange\",\"cidrAddress\":\"188.39.124.218/32\"}]}]}"}